[
  {
    "nama": "17 Agustus 1945",
    "history": "Sejarah Kemerdekaan Indonesia 17 Agustus 1945 Proklamasi Kemerdekaan RI 17 Agustus 1945 berawal dari kabar bahwa Jepang menyerah tanpa syarat kepada Sekutu setelah Kota Hiroshima dan Nagasaki dibom oleh Sekutu pada 15 Agustus dua hari sebelumnya.Para pejuang golongan muda yang mendengar kabar tersebut dari Radio BBC kemudian mulai mendesak Sukarno dan Hatta agar memanfaatkan momentum sesegera mungkin untuk memproklamasikan kemerdekaan.Desakan ini memunculkan perdebatan antara golongan muda dan golongan tua lantaran belum ada pernyataan resmi dari pihak Jepang. Oleh sebab itu, golongan tua meminta agar menunggu hingga tanggal 24 Agustus 1945.Pada akhirnya, pada 15 Agustus 1945 di bawah koordinasi Sukarni, Chaerul Saleh, dan Wikana, maka Sukarno dan Hatta dibawa ke Rengasdengklok. Hal ini dilakukan dengan harapan kemerdekaan dapat dipercepat. Singkat cerita, Sukarno dan Hatta dapat kembali bersama Ahmad Soebardjo dengan jaminan proklamasi akan dilakukan esok harinya.Pada malam harinya, mereka sampai di rumah Laksamana Maeda guna membahas hal tersebut. Pada 17 Agustus 1945 pukul 03.00 WIB, naskah proklamasi yang disusun dalam dua alinea itu rampung dua jam kemudian.Naskah teks proklamasi kemudian diserahkan kepada Sayuti Melik untuk diketik. Dia dibersamai oleh BM Diah. Setelah selesai, naskah ditandatangani oleh Sukarno.Beberapa jam kemudian pada 17 Agustus pukul 10.00 WIB, naskah proklamasi dibacakan di rumah Sukarno Jalan Pegangsaan Timur nomor 56. Kabar mengenai proklamasi pun disebarluaskan.",
    "img": "https://upload.wikimedia.org/wikipedia/commons/f/f1/Indonesia_declaration_of_independence_17_August_1945.jpg"
  },
  {
    "nama": "G30SPKI",
    "history": "Sejarah G30S PKI Peristiwa G30S PKI terjadi pada tahun 1965 dan dimotori oleh Dipa Nusantara Aidit atau DN Aidit, pemimpin terakhir PKI. Di bawah kendali DN Aidit, perkembangan PKI semakin nyata walaupun diperoleh melalui sistem parlementer.Dikutip dari buku Api Sejarah 2 oleh Ahmad Mansur Suryanegara, menurut Arnold C. Brackman, DN Aidit mendukung konsep Khrushchev, yakni If everything depends on the communist we would follow the peaceful way (bila segalanya bergantung pada komunis, kita harus mengikuti dengan cara perdamaian).Pandangan itu disebut bertentangan dengan konsep Mao Ze Dong dan Stalin yang secara terbuka menyatakan bahwa komunisme dikembangkan hanya dengan melalui perang.G30S PKI terjadi pada malam hingga dini hari, tepat pada akhir tanggal 30 September dan masuk 1 Oktober 1965.Gerakan pemberontakan yang dilakukan oleh PKI mengincar perwira tinggi TNI AD Indonesia. Tiga dari enam orang yang menjadi target langsung dibunuh di kediamannya. Sedangkan lainnya diculik dan dibawa menuju Lubang Buaya.Keenam perwira tinggi yang menjadi korban G30S PKI antara lain Letnan Jenderal Anumerta Ahmad Yani, Mayor Jenderal Raden Soeprapto, Mayor Jenderal Mas Tirtodarmo Haryono, Mayor Jenderal Siswondo Parman, Brigadir Jenderal Donald Isaac Panjaitan dan Brigadir Jenderal Sutoyo Siswomiharjo.",
    "img": "https://awsimages.detik.net.id/community/media/visual/2022/09/25/monumen-g30s-pki-serba-serbi-monumen-pancasila-sakti_169.jpeg?w=1200"
  },
  {
    "nama": "Bandung Lautan Api",
    "history": "Meski Indonesia telah mengumandangkan kemerdekaannya, penjajah tetap berupaya merebut kembali wilayah Indonesia. Banyak cara dilakukan untuk mempertahankan kawasan Indonesia dari serangan penjajah. Salah satunya, perlawanan rakyat Bandung yang dikenal dengan Bandung Lautan Api. Perlawanan itu terjadi pada 23 Maret 1946. Dalam waktu tujuh jam, warga Bandung membakar rumah mereka dan mengungsi ke wilayah pegunungan di selatan Bandung. Seketika, Bandung berubah menjadi lautan api. Pembakaran rumah tersebut menjadi jalan terakhir yang ditempuh TRI (Tentara Republik Indonesia), ketika melihat ketidakseimbangan pasukan Indonesia dengan tentara Sekutu dan NICA.Pada 12 Oktober 1945, pasukan Inggris dari Brigade MacDonald tiba di Bandung. Mereka ingin menguasai kota ini untuk dijadikan markas strategis militer. Mereka menuntut agar semua senjata api yang dirampas dari tentara Belanda, dikembalikan. Selain itu, tawanan Belanda yang baru saja dibebaskan kembali berulah dan melakukan tindakan yang mengganggu keamanan. Akibatnya, terjadilah bentrokan bersenjata antara Inggris dan tentara Indonesia.Bandung Lautan Api menjadi salah satu peristiwa heroik terbesar dalam mempertahankan kemerdekaan Indonesia. Peristiwa ini menjadi sumber inspirasi bagi Ismail Marzuki untuk menciptakan lagu berjudul “Halo-Halo Bandung”. Sebuah lagu yang menggambarkan semangat perjuangan masyarakat Bandung dalam peristiwa tersebut.",
    "img": "https://mmc.tirto.id/image/otf/500x0/2017/03/21/BandunLautanApi2_ratio-16x9.jpg"
  },
  {
    "nama": "Sumpah Pemuda",
    "history": "Sumpah Pemuda adalah peristiwa bersejarah di Indonesia yang terjadi pada tanggal 28 Oktober 1928. Pada saat itu, para pemuda dari berbagai daerah di Indonesia berkumpul dalam Kongres Pemuda II di Jakarta. Mereka bersumpah untuk menyatukan bangsa Indonesia di bawah satu tanah air, satu bangsa, dan satu bahasa, yaitu bahasa Indonesia. Sumpah ini juga menegaskan penolakan terhadap penggunaan bahasa asing. Peristiwa ini menjadi tonggak penting dalam perjuangan kemerdekaan Indonesia karena menguatkan semangat persatuan dan identitas nasional. Bahasa Indonesia juga diakui sebagai bahasa nasional, memainkan peran penting dalam proses menuju kemerdekaan Indonesia, yang akhirnya tercapai pada tanggal 17 Agustus 1945.",
    "img": "https://asset.kompas.com/data/photo/2019/10/28/5db6a7eec246d.jpg"
  },
  {
    "nama": "Peristiwa Rengas Dengklok",
    "history": "Rengasdengklok Pemuda adalah peristiwa bersejarah yang terjadi pada tanggal 16 September 1945. Pada saat itu, sekelompok pemuda pejuang Indonesia yang dipimpin oleh Soekarni, Wikana, dan Chaerul Saleh berusaha mengamankan Soekarno dan Mohammad Hatta, dua pemimpin proklamator kemerdekaan Indonesia, dari penangkapan oleh tentara Jepang yang masih berkuasa setelah kalahnya Jepang dalam Perang Dunia II. Mereka menghadapi situasi yang sangat tegang dan berhasil membawa Soekarno dan Hatta ke Jakarta, menjaga kemerdekaan Indonesia yang baru saja diproklamasikan pada tanggal 17 Agustus 1945. Peristiwa Rengasdengklok Pemuda menegaskan tekad para pemuda Indonesia untuk mempertahankan kemerdekaan dan menghadapi tantangan dalam perjalanan menuju negara merdeka yang baru saja terlahir.",
    "img": "https://sma13smg.sch.id/wp-content/uploads/2022/08/presiden-soekarno-di-rengasdengklok.jpg"
  },
  {
    "nama": "Sejarah Perumusan Pancasila",
    "history": "Perumusan Pancasila merupakan momen krusial dalam sejarah Indonesia yang terjadi pada tanggal 1 Juni 1945. Pada saat itu, sejumlah pemimpin dan intelektual Indonesia yang tergabung dalam Badan Penyelidik Usaha-usaha Persiapan Kemerdekaan Indonesia (BPUPKI) dan Panitia Persiapan Kemerdekaan Indonesia (PPKI) berkumpul untuk menentukan landasan ideologis negara yang baru merdeka.Pancasila, yang bermakna lima prinsip, dihasilkan sebagai dasar negara yang mencakup prinsip-prinsip utama: Ketuhanan Yang Maha Esa, Kemanusiaan yang Adil dan Beradab, Persatuan Indonesia, Kerakyatan yang Dipimpin oleh Hikmat Kebijaksanaan dalam Permusyawaratan Perwakilan, dan Keadilan Sosial bagi Seluruh Rakyat Indonesia. Perumusan Pancasila ini mewakili komitmen untuk menjaga keberagaman, keadilan, dan persatuan dalam pembangunan negara Indonesia yang baru lahir.Pancasila kemudian diresmikan sebagai ideologi negara dan tercantum dalam Pembukaan Undang-Undang Dasar 1945. Ini menjadi dasar moral dan filosofis yang mengikat bagi seluruh warga negara Indonesia, menjadikan Pancasila sebagai pilar penting dalam pembentukan dan pengembangan negara Indonesia yang merdeka.",
    "img": "https://nusantaranews.co/assets/uploads/2019/06/Perumusan-Pancasila-Secara-Sistematik-Untuk-Pertama-Kali.jpg"
  },
  {
    "nama": "Budi Utomo",
    "history": "Budi Utomo adalah organisasi yang menjadi tonggak awal gerakan nasionalis di Indonesia. Didirikan pada tanggal 20 Mei 1908 di Surabaya oleh sekelompok pemuda terpelajar yang dipimpin oleh Dr. Soetomo. Organisasi ini memiliki tujuan utama untuk memperjuangkan kesejahteraan rakyat Indonesia melalui pendidikan dan peningkatan kesadaran nasional.Budi Utomo mengadvokasi pendidikan sebagai sarana untuk mengangkat martabat bangsa Indonesia dan menentang diskriminasi rasial yang diterapkan oleh pemerintah kolonial Belanda. Mereka juga mengedepankan kebanggaan akan budaya dan bahasa Indonesia. Budi Utomo menjadi cikal bakal bagi gerakan nasionalis yang lebih besar, dan semangatnya untuk memperjuangkan kemerdekaan Indonesia terus berkembang dan menginspirasi generasi-generasi berikutnya. Organisasi ini memainkan peran penting dalam perjalanan menuju kemerdekaan Indonesia yang akhirnya tercapai pada tahun 1945.",
    "img": "https://cdn-assetd.kompas.id/ai53akhdRkcVDeHVbYFteqZzpr4=/1024x576/https%3A%2F%2Fkompaspedia.kompas.id%2Fwp-content%2Fuploads%2F2021%2F05%2FSTOVIA.jpg"
  },
  {
    "nama": "Pertempuran Medan Area",
    "history": "Pertempuran Medan Area adalah salah satu pertempuran penting dalam sejarah Perang Dunia II yang berlangsung di Asia Tenggara dan melibatkan pasukan Sekutu yang dipimpin oleh Jenderal Joseph Stilwell serta pasukan Jepang di Burma (sekarang Myanmar) pada tahun 1944. Pertempuran ini memiliki beberapa karakteristik kunci:Pada awalnya, pasukan Sekutu mengalami kesulitan besar melawan pasukan Jepang yang memiliki keunggulan dalam pertempuran hutan dan medan yang sulit di Burma. Namun, melalui tekad yang kuat dan strategi yang matang, pasukan Sekutu berhasil membalikkan keadaan.Pertempuran Medan Area menjadi bagian penting dalam kampanye Burma, yang bertujuan untuk merebut kembali Burma dari Jepang dan membuka jalur darat yang vital untuk mendukung Cina dalam perang melawan Jepang. Pertempuran ini juga menandai kerjasama antara pasukan Sekutu yang beragam, termasuk pasukan Amerika Serikat, Britania Raya, dan Cina.Hasil dari pertempuran ini adalah kemenangan pasukan Sekutu yang berhasil merebut kembali wilayah Burma, membuka jalur darat ke Cina, dan memaksa pasukan Jepang untuk mundur. Keberhasilan ini memiliki dampak strategis yang signifikan dalam perang melawan Jepang di Asia Tenggara dan membantu memutus jalur pasokan Jepang ke Cina.",
    "img": "https://cdn1.katadata.co.id/media/images/thumb/2022/03/25/Pertempuran_Medan_Area-2022_03_25-14_52_53_87bfd030b7acc0cc9d560329d243d903_960x640_thumb.jpg"
  },
  {
    "nama": "Sejarah 10 Novembber di Surabaya",
    "history": "Pada tanggal 10 November 1945, Surabaya menjadi saksi dari salah satu peristiwa bersejarah dalam perjuangan kemerdekaan Indonesia. Cerita ini menggambarkan momen penting ketika pasukan Indonesia dan pasukan Inggris terlibat dalam pertempuran sengit di kota ini.Pagi itu, suasana di Surabaya sangat tegang. Pasukan Inggris telah tiba di kota ini dengan tujuan untuk merebut kembali kendali dari pemerintahan Indonesia yang baru saja menyatakan kemerdekaan. Tentara Indonesia, bersama dengan rakyat sipil yang bersemangat, bersiap-siap untuk membela kota mereka.Pertempuran dimulai ketika pasukan Inggris mencoba untuk menguasai sejumlah fasilitas penting, seperti pelabuhan dan stasiun kereta api. Pasukan Indonesia dengan gigih melawan serangan ini, dan pertempuran cepat berkembang menjadi konflik yang berlarut-larut dan sengit. Jalan-jalan Surabaya menjadi medan perang, dan para pejuang kemerdekaan menggunakan berbagai taktik untuk melawan pasukan Inggris yang lebih kuat secara militer.Selama pertempuran ini, banyak korban jiwa dari kedua belah pihak. Namun, semangat perjuangan rakyat Surabaya tidak tergoyahkan. Mereka mempertahankan kemerdekaan mereka dengan penuh semangat dan keyakinan bahwa mereka berhak untuk merdeka.Peristiwa 10 November 1945 di Surabaya menjadi salah satu titik balik dalam sejarah perjuangan kemerdekaan Indonesia. Meskipun pasukan Inggris akhirnya berhasil mengendalikan kota tersebut setelah beberapa minggu, semangat perlawanan yang ditunjukkan oleh rakyat Surabaya menjadi inspirasi bagi perjuangan kemerdekaan Indonesia yang lebih luas. Peristiwa ini juga menunjukkan tekad rakyat Indonesia untuk mempertahankan kemerdekaan mereka hingga akhirnya meraihnya pada tahun 1949.10 November kemudian menjadi Hari Pahlawan di Indonesia, sebuah hari untuk menghormati dan mengenang perjuangan para pahlawan yang berjuang untuk kemerdekaan negara ini, termasuk mereka yang gugur dalam pertempuran sengit di Surabaya pada tanggal tersebut.",
    "img": "https://lh3.googleusercontent.com/-48D_cRaqyCU/VkCX8tA7vfI/AAAAAAAABSk/3kKe6RHjYT8/220px-Bung_Tomo.jpg"
  },
  {
    "nama": "Perundingan Linggarjati",
    "history": "Perundingan Linggarjati adalah serangkaian perundingan yang berlangsung pada tahun 1946 antara pemerintah Indonesia yang diproklamasikan pada tahun 1945 dan pemerintah Belanda. Perundingan ini bertujuan untuk menyelesaikan konflik yang berkecamuk di Indonesia pasca-Proklamasi Kemerdekaan. Kesepakatan Linggarjati akhirnya dicapai pada tanggal 25 Maret 1947 di Linggarjati, Jawa Barat. Kesepakatan ini mengakui de facto kemerdekaan Indonesia dalam bentuk Republik Indonesia Serikat (RIS) yang masih terikat dengan Kerajaan Belanda.Meskipun kesepakatan ini awalnya menandai langkah menuju perdamaian, perundingan Linggarjati kemudian menyulitkan hubungan antara Indonesia dan Belanda karena pelaksanaannya yang penuh kontroversi dan perselisihan interpretasi. Konflik bersenjata antara kedua belah pihak terus berlanjut.Perundingan Linggarjati tetap memiliki arti penting dalam sejarah Indonesia karena menunjukkan upaya perdamaian awal dalam perjuangan diplomasi untuk mengakui kemerdekaan Indonesia. Meskipun perjalanan menuju pengakuan internasional dan kedaulatan penuh Indonesia masih panjang, peristiwa Linggarjati menjadi salah satu babak awal dalam proses menuju kemerdekaan yang akhirnya tercapai pada tahun 1949.",
    "img": "https://mmc.tirto.id/image/2021/01/27/sultansjahrir.jpg"
  },
  {
    "nama": "Perundingan Roem Royen",
    "history": "Perundingan Roem-Royen adalah serangkaian perundingan yang berlangsung pada tahun 1949 antara delegasi Indonesia yang dipimpin oleh Mohammad Roem dan Mohammad Hatta, dengan delegasi Belanda yang dipimpin oleh Jan Herman van Roijen. Perundingan ini bertujuan untuk mengakhiri konflik bersenjata antara Indonesia dan Belanda, yang telah berlangsung selama beberapa tahun setelah perundingan Linggarjati.Hasil perundingan Roem-Royen adalah Penyataan Kedaulatan Republik Indonesia yang ditandatangani pada tanggal 27 Desember 1949 di Den Haag, Belanda. Dokumen ini mengakui kedaulatan Republik Indonesia Serikat (RIS) dan menandai akhir dari penjajahan kolonial Belanda di Indonesia.Perundingan Roem-Royen adalah langkah penting dalam perjalanan menuju kemerdekaan Indonesia. Meskipun masih ada beberapa perselisihan dan sengketa wilayah yang belum terselesaikan, perundingan ini menandai awal dari pengakuan internasional terhadap kedaulatan Indonesia dan menjadi tonggak penting dalam sejarah bangsa ini. Pada tahun 1950, RIS berganti nama menjadi Republik Indonesia yang kita kenal saat ini, dan Indonesia secara resmi menjadi negara merdeka.",
    "img": "https://www.stiepasim.ac.id/wp-content/uploads/2023/05/WhatsApp-Image-2023-05-08-at-9.44.56-AM.jpeg"
  },
  {
    "nama": "Konverensi Meja Bundar (KMB)",
    "history": "Konferensi Meja Bundar (KMB) adalah peristiwa penting dalam sejarah Indonesia yang berlangsung antara 23 Agustus dan 2 November 1949 di Den Haag, Belanda. Konferensi ini merupakan upaya penyelesaian konflik antara Indonesia dan Belanda yang berlarut-larut pasca-Proklamasi Kemerdekaan Indonesia pada tahun 1945.Hasil dari Konferensi Meja Bundar adalah perjanjian yang mengakui kedaulatan Republik Indonesia. Perjanjian ini mengakhiri penjajahan kolonial Belanda di Indonesia, dan Indonesia secara resmi merdeka pada tanggal 27 Desember 1949. Selain itu, perjanjian ini juga membahas sejumlah isu penting, termasuk penarikan pasukan Belanda, pembebasan tawanan perang, dan penyerahan wilayah yang masih menjadi sengketa.Konferensi Meja Bundar menandai langkah besar dalam perjalanan menuju kemerdekaan Indonesia. Meskipun ada kompromi yang dilakukan oleh kedua belah pihak, konferensi ini menyelesaikan konflik yang telah berlangsung selama bertahun-tahun dan membawa Indonesia ke panggung internasional sebagai negara merdeka. Peristiwa ini juga menandai akhir dari penjajahan kolonial di Indonesia dan permulaan dari perjalanan Indonesia sebagai negara merdeka.",
    "img": "https://cdns.klimg.com/merdeka.com/i/w/news/2021/11/01/1370622/540x270/sejarah-2-november-1949-berakhirnya-konferensi-meja-bundar-di-den-haag.jpg"
  },
  {
    "nama": "Pertempuran Ambarawa",
    "history": "Pertempuran Ambarawa adalah salah satu peristiwa penting dalam sejarah perjuangan kemerdekaan Indonesia. Peristiwa ini terjadi pada tanggal 20 Desember 1945 di daerah Ambarawa, Jawa Tengah, dalam konteks Agresi Militer Belanda I. Pasukan Indonesia yang dipimpin oleh Letnan Jenderal Soedirman dan Mayor Isdiman bertempur melawan pasukan Belanda yang mencoba merebut kembali wilayah Jawa Tengah yang telah dikuasai oleh pasukan Indonesia.Meskipun pasukan Indonesia dalam kondisi yang sangat tidak seimbang dalam hal persenjataan, mereka menunjukkan semangat perjuangan yang tinggi dan keberanian yang luar biasa. Pertempuran ini berlangsung sengit dan menghasilkan kekalahan bagi pasukan Belanda. Meskipun demikian, pertempuran ini juga menimbulkan kerugian yang besar bagi kedua belah pihak.Pertempuran Ambarawa adalah simbol perlawanan gigih pasukan Indonesia dalam melawan agresi militer Belanda dan merupakan salah satu momen bersejarah yang menegaskan tekad untuk mempertahankan kemerdekaan. Keberhasilan pasukan Indonesia di Ambarawa juga menjadi inspirasi dalam perjuangan menuju kemerdekaan Indonesia yang akhirnya tercapai pada tahun 1949.",
    "img": "https://cdnwpedutorenews.gramedia.net/wp-content/uploads/2022/07/18072532/image001-40.jpg"
  },
  {
    "nama": "Dekrit Presiden",
    "history": "Dekret Presiden 5 Juli 1959 – Pada 5 Juli 1959, Presiden pertama Indonesia yaitu Soekarno mengeluarkan dekrit atau sebuah keputusan (ketetapan) presiden yang berisi memberlakukan kembali Undang-Undang Dasar tahun 1945.Dekrit Presiden 5 Juli tahun 1959 dikeluarkan oleh presiden dikarenakan adanya kegagalan oleh Badan Konstituante dalam menetapkan UUD baru sebagai pengganti dari UUD Sementara atau UUDS di tahun 1950.Ketika itu, Dekrit Presiden 5 Juli 1959 memiliki tujuan untuk dapat mengatasi kegagalan dari konstituante serta ketidakstabilan politik di Indonesia. Dengan dikeluarkannya Dekrit Presiden 5 Juli 1959, pemerintah pun kembali memberlakukan UUD 1945. Oleh karenanya, sistem pemerintahan yang dijalankan di Indonesia merupakan sistem pemerintahan demokrasi terpimpin.",
    "img": "https://asset.kompas.com/crops/YNKJytrjq91rRHivPaWbRBeXv5Q=/2x0:845x562/750x500/data/photo/2022/03/17/623294922b9c3.jpeg"
  }
]